content/old-pages/keto.md
+++
title = "Keto"
date = 2018-03-18T17:52:56-04:00
tags = []
categories = []
draft = false
inprogress = true
+++

[//]: # (tags = ["health", "nutrition", "diets"], categories = ["Science/Knowledge"])

## About Ketosis {#about-ketosis}

-   <http://eatingacademy.com/nutrition/ketosis-advantaged-or-misunderstood-state-part-i>
-   <http://eatingacademy.com/nutrition/ketosis-advantaged-or-misunderstood-state-part-ii>
-   <http://eatingacademy.com/sports-and-nutrition/ketones-carbohydrates-can-co-exist>
-   <http://eatingacademy.com/nutrition/the-interplay-of-exercise-and-ketosis-part-i>
-   <http://eatingacademy.com/nutrition/the-interplay-of-exercise-and-ketosis-part-ii>
-   <https://www.amazon.com/Art-Science-Low-Carbohydrate-Living/dp/0983490708/>
-   <https://www.amazon.com/Art-Science-Low-Carbohydrate-Performance/dp/0983490716/>


## Starting List of Foods {#starting-list-of-foods}

-   Meat
    -   Beef sausage patties, ground beef, steaks/stew meats, liverwurst; chicken breasts; bacon; lamb; salmon and sardines; bone broth/gelatin

-   Other Core Foods
    -   Coconut oil; EVOO; butter and ghee; eggs; avocados; almond butter

-   Vegetables
    -   Broccoli, cauliflower, Brussels sprouts, kale, spinach, arugula, bok choy, cabbage, swiss chard, asparagus, celery, etc.

-   Snacks
    -   Almonds, pumpkin seeds, and macadamia nuts; pork rinds/cracklings; beef jerky/snack sticks.

-   Dairy (optional)
    -   Raw cheddar and mozzarella, cream cheese/heavy cream

-   Baking (optional)
    -   Almond meal, coconut flour; stevia/monkfruit/erythritol, raw cacao, vanilla

-   Berries (optional -- in moderation)
    -   Blackberries, raspberries, strawberries


## Best Fruits And Vegetables For Keto {#best-fruits-and-vegetables-for-keto}

-   <https://www.ruled.me/best-low-carb-vegetables-ketogenic-diet/>
-   <https://ketogasm.com/ultimate-low-carb-vegetables-list/>
-   <https://www.ruled.me/best-low-carb-fruits-avoid/>


## Adapting Foods To Keto {#adapting-foods-to-keto}

-   <http://cookyscreations.blogspot.com/2012/06/holy-grail-of-ketolow-carb-pizza-crust.html>
-   <https://www.reddit.com/r/keto/comments/1r12ru/master%5Flist%5Fof%5Fbread%5Fsubstitutes/>
